nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/spi_flash.c
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : spi_flash.c
* Author             : MCD Application Team
* Version            : V2.0.3
* Date               : 09/22/2008
* Description        : This file provides a set of functions needed to manage the
*                      communication between SPI peripheral and SPI M25P64 FLASH.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "spi_flash.h"
#include "spi_flash_app.h"
#include "stm32f10x.h"
#include "stm32f10x_spi.h"


/* Private typedef -----------------------------------------------------------*/
#define SPI_FLASH_PageSize    0x100

/* Private define ------------------------------------------------------------*/
#define WRITE      0x02  /* Write to Memory instruction */
#define WRSR       0x01  /* Write Status Register instruction */
#define WREN       0x06  /* Write enable instruction */

#define READ       0x03  /* Read from Memory instruction */
#define READ_0B	   0x0B
#define RDSR       0x05  /* Read Status Register instruction  */
#define RDID       0x9F  /* Read identification */
#define SE         0x20  /* Sector Erase instruction */
#define BE         0xC7  /* Bulk Erase instruction */

#define UPROTECT   0x39

#define WIP_Flag   0x01  /* Write In Progress (WIP) flag */

#define Dummy_Byte 0xA5

#define FLASH_DELAY_COUNT_MAX	100	//FLASH操作最大延时0.5s，超出0.3s后跳出死循环

//************本地变量*****************
static u32 FlashDelayCount = 0;	//FLASH读写延时计数

u8	ZhikuAreaWriteEnableFlag = 0;//字库区域写使能标志,0为不使能,1为使能
/*******************************************************************************
* Function Name  : spi_Delay_uS(u32 x)
* Description    : 延时，单位微妙
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void spi_Delay_uS(u32 x)
{ u32 i;
  for(i = 0; i <= x; i ++);
}
/*******************************************************************************
* Function Name  : IncFlashDelayCount
* Description    : FlashDelayCount变量加1
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void IncFlashDelayCount(void)
{
	if(0xFFFFFFF0 == FlashDelayCount)
	{
		FlashDelayCount = 0;//防止产生溢出中断
	}
	FlashDelayCount++;
}
/*******************************************************************************
* Function Name  : SPI_FLASH_Init
* Description    : Initializes the peripherals used by the SPI FLASH driver.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_Init(void)
{
  SPI_InitTypeDef  SPI_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable SPI1 and GPIO clocks */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1 | RCC_APB2Periph_GPIOA |
                         RCC_APB2Periph_FLASH_CS, ENABLE);

  /* Configure SPI1 pins: SCK, MISO and MOSI */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* Configure I/O for Flash Chip select */
  GPIO_InitStructure.GPIO_Pin = SPI_FLASH_CS_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(SPI_FLASH_CS_PORT, &GPIO_InitStructure);

  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();
  
  /* SPI1 configuration */
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
  //SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  //SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(SPI1, &SPI_InitStructure);

  /* Enable SPI1  */
  SPI_Cmd(SPI1, ENABLE);
  
}

/*******************************************************************************
* Function Name  : SPI_FLASH_SectorErase
* Description    : Erases the specified FLASH sector.
* Input          : SectorAddr: address of the sector to erase.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_SectorErase(u32 SectorAddr)
{
	if(0 == ZhikuAreaWriteEnableFlag)
	{
		//保护汉字库
		if(SectorAddr < FLASH_HZK16_END_ADDR)
		{
			return ;
		}
	}
	/* Flash Unprotect */
	SPI_FLASH_AllUnprotect();
	
  	/* Send write enable instruction */
  	SPI_FLASH_WriteEnable();

  	/* Sector Erase */
  	/* Select the FLASH: Chip Select low */
  	SPI_FLASH_CS_LOW();

  	/* Send Sector Erase instruction */
  	SPI_FLASH_SendByte(SE);

  	/* Send SectorAddr high nibble address byte */
  	SPI_FLASH_SendByte((SectorAddr & 0xFF0000) >> 16);

  	/* Send SectorAddr medium nibble address byte */
  	SPI_FLASH_SendByte((SectorAddr & 0xFF00) >> 8);

  	/* Send SectorAddr low nibble address byte */
  	SPI_FLASH_SendByte(SectorAddr & 0xFF);

  	/* Deselect the FLASH: Chip Select high */
  	SPI_FLASH_CS_HIGH();

	/* Wait the end of Flash writing */
  	SPI_FLASH_WaitForWriteEnd();

	/* Flash Protect */
	SPI_FLASH_AllProtect();

