nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/spi_flash.c
  // Send "Read from Memory " instruction 
  SPI_FLASH_SendByte(READ);

  // Send ReadAddr high nibble address byte to read from 
  SPI_FLASH_SendByte((ReadAddr & 0xFF0000) >> 16);
  // Send ReadAddr medium nibble address byte to read from 
  SPI_FLASH_SendByte((ReadAddr& 0xFF00) >> 8);
  // Send ReadAddr low nibble address byte to read from 
  SPI_FLASH_SendByte(ReadAddr & 0xFF);

  while (NumByteToRead--) // while there is data to be read
  {
    // Read a byte from the FLASH 
    *pBuffer = SPI_FLASH_SendByte(Dummy_Byte);
    // Point to the next location where the byte read will be saved 
    pBuffer++;
  }

  // Deselect the FLASH: Chip Select high 
  SPI_FLASH_CS_HIGH();
}
*/

void SPI_FLASH_BufferRead(u8* pBuffer, u32 ReadAddr, u16 NumByteToRead)
{
  // Select the FLASH: Chip Select low
  SPI_FLASH_CS_LOW();

  // Send "Read from Memory " instruction 
  SPI_FLASH_SendByte(READ_0B);

  // Send ReadAddr high nibble address byte to read from 
  SPI_FLASH_SendByte((ReadAddr & 0xFF0000) >> 16);
  // Send ReadAddr medium nibble address byte to read from 
  SPI_FLASH_SendByte((ReadAddr& 0xFF00) >> 8);
  // Send ReadAddr low nibble address byte to read from 
  SPI_FLASH_SendByte(ReadAddr & 0xFF);
  
  // Send a Dummy Byte
  SPI_FLASH_SendByte(Dummy_Byte);

  while (NumByteToRead--) // while there is data to be read
  {
    // Read a byte from the FLASH 
    *pBuffer = SPI_FLASH_SendByte(Dummy_Byte);
    // Point to the next location where the byte read will be saved 
    pBuffer++;
  }

  // Deselect the FLASH: Chip Select high 
  SPI_FLASH_CS_HIGH();
}

/*******************************************************************************
* Function Name  : SPI_FLASH_ReadID
* Description    : Reads FLASH identification.
* Input          : None
* Output         : None
* Return         : FLASH identification
*******************************************************************************/
u32 SPI_FLASH_ReadID(void)
{
  u32 Temp = 0, Temp0 = 0, Temp1 = 0, Temp2 = 0, Temp3 = 0;

  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "RDID " instruction */
  SPI_FLASH_SendByte(0x9F);

  /* Read a byte from the FLASH */
  Temp0 = SPI_FLASH_SendByte(Dummy_Byte);

  /* Read a byte from the FLASH */
  Temp1 = SPI_FLASH_SendByte(Dummy_Byte);

  /* Read a byte from the FLASH */
  Temp2 = SPI_FLASH_SendByte(Dummy_Byte);
  
  Temp3 = SPI_FLASH_SendByte(Dummy_Byte);

  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();

  Temp = (Temp0 << 24) | (Temp1 << 16) | (Temp2 << 8) | Temp3;

  return Temp;
}

/*******************************************************************************
* Function Name  : SPI_FLASH_StartReadSequence
* Description    : Initiates a read data byte (READ) sequence from the Flash.
*                  This is done by driving the /CS line low to select the device,
*                  then the READ instruction is transmitted followed by 3 bytes
*                  address. This function exit and keep the /CS line low, so the
*                  Flash still being selected. With this technique the whole
*                  content of the Flash is read with a single READ instruction.
* Input          : - ReadAddr : FLASH's internal address to read from.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_StartReadSequence(u32 ReadAddr)
{
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "Read from Memory " instruction */
  SPI_FLASH_SendByte(READ);

  /* Send the 24-bit address of the address to read from -----------------------*/
  /* Send ReadAddr high nibble address byte */
  SPI_FLASH_SendByte((ReadAddr & 0xFF0000) >> 16);
  /* Send ReadAddr medium nibble address byte */
  SPI_FLASH_SendByte((ReadAddr& 0xFF00) >> 8);
  /* Send ReadAddr low nibble address byte */
  SPI_FLASH_SendByte(ReadAddr & 0xFF);
  
}

/*******************************************************************************
* Function Name  : SPI_FLASH_ReadByte
* Description    : Reads a byte from the SPI Flash.
*                  This function must be used only if the Start_Read_Sequence
*                  function has been previously called.
* Input          : None
* Output         : None
* Return         : Byte Read from the SPI Flash.
*******************************************************************************/
u8 SPI_FLASH_ReadByte(void)
{
  return (SPI_FLASH_SendByte(Dummy_Byte));
}

/*******************************************************************************
* Function Name  : SPI_FLASH_SendByte
* Description    : Sends a byte through the SPI interface and return the byte
*                  received from the SPI bus.
* Input          : byte : byte to send.
* Output         : None
* Return         : The value of the received byte.
*******************************************************************************/
u8 SPI_FLASH_SendByte(u8 byte)
{
  //FLASH操作延时计数清0
  FlashDelayCount = 0;
	
  /* Loop while DR register in not emplty */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET)
  {
  	if(FlashDelayCount > FLASH_DELAY_COUNT_MAX)
	{
		break;//超出规定时间，跳出循环
	}
  }

  /* Send byte through the SPI1 peripheral */
  SPI_I2S_SendData(SPI1, byte);
  
  //FLASH操作延时计数清0
  FlashDelayCount = 0;
  /* Wait to receive a byte */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET)
  {
  	if(FlashDelayCount > FLASH_DELAY_COUNT_MAX)
	{
		break;//超出规定时间，跳出循环
	}
  }

  /* Return the byte read from the SPI bus */
  return SPI_I2S_ReceiveData(SPI1);
}

/*******************************************************************************
* Function Name  : SPI_FLASH_SendHalfWord
* Description    : Sends a Half Word through the SPI interface and return the
*                  Half Word received from the SPI bus.
* Input          : Half Word : Half Word to send.
* Output         : None
* Return         : The value of the received Half Word.
*******************************************************************************/
u16 SPI_FLASH_SendHalfWord(u16 HalfWord)
{
  //FLASH操作延时计数清0
  FlashDelayCount = 0;
  
  /* Loop while DR register in not emplty */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET)
  {
  	if(FlashDelayCount > FLASH_DELAY_COUNT_MAX)
	{
		break;//超出规定时间，跳出循环
	}
  }

  /* Send Half Word through the SPI1 peripheral */
  SPI_I2S_SendData(SPI1, HalfWord);

  //FLASH操作延时计数清0
  FlashDelayCount = 0;
  /* Wait to receive a Half Word */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET)
  {
  	if(FlashDelayCount > FLASH_DELAY_COUNT_MAX)
	{
		break;//超出规定时间，跳出循环
	}
  }

  /* Return the Half Word read from the SPI bus */
  return SPI_I2S_ReceiveData(SPI1);
}

