nileiori/GB3/src/boot/GD32F1XX - boot/GD32F1XX - boot2/USER/spi_flash.c
/*******************************************************************************
* Function Name  : SPI_FLASH_WriteEnable
* Description    : Enables the write access to the FLASH.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_WriteEnable(void)
{
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "Write Enable" instruction */
  SPI_FLASH_SendByte(WREN);

  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();
}

/*******************************************************************************
* Function Name  : SPI_FLASH_SectorUnprotect
* Description    : Enables the write access to the FLASH.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_SectorUnprotect(u32 SectorAddr)
{
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "Unprotect" instruction */
  SPI_FLASH_SendByte(UPROTECT);
  
  SPI_FLASH_SendByte((SectorAddr & 0xFF0000) >> 16);
  /* Send SectorAddr medium nibble address byte */
  SPI_FLASH_SendByte((SectorAddr & 0xFF00) >> 8);
  /* Send SectorAddr low nibble address byte */
  SPI_FLASH_SendByte(SectorAddr & 0xFF);
  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();
}

/*******************************************************************************
* Function Name  : SPI_FLASH_AllUnprotect
* Description    : Enables the write access to the FLASH.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_AllUnprotect(void)
{
	u8 statereg = 0x00;
	
		 /* Enable the write access to the FLASH */
  SPI_FLASH_WriteEnable();
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "Unprotect" instruction */
  SPI_FLASH_SendByte(WRSR);
  
  SPI_FLASH_SendByte(statereg);
 
  SPI_FLASH_CS_HIGH();
  
  SPI_FLASH_WaitForWriteEnd();
}

/*******************************************************************************
* Function Name  : SPI_FLASH_AllUnprotect
* Description    : Enables the write access to the FLASH.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_AllProtect(void)
{
	u8 statereg = 0x3C;
	

	/* Enable the write access to the FLASH */
  SPI_FLASH_WriteEnable();
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "Unprotect" instruction */
  SPI_FLASH_SendByte(WRSR);
  
  SPI_FLASH_SendByte(statereg);
 
  SPI_FLASH_CS_HIGH();
  
  SPI_FLASH_WaitForWriteEnd();
}
/*******************************************************************************
* Function Name  : SPI_FLASH_ReadStatus
* Description    : Read Status Register
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
u8 SPI_FLASH_ReadStatus(void)
{
	u8 FLASH_Status = 0;
	/* Select the FLASH: Chip Select low */
  	SPI_FLASH_CS_LOW();
	
	/* Send "Read Status Register" instruction */
  	SPI_FLASH_SendByte(RDSR);
	
	/* Send a dummy byte to generate the clock needed by the FLASH
    	and put the value of the status register in FLASH_Status variable */
	FLASH_Status = SPI_FLASH_SendByte(Dummy_Byte);
	
	/* Deselect the FLASH: Chip Select high */
  	SPI_FLASH_CS_HIGH();
	
	return FLASH_Status;
}
/*******************************************************************************
* Function Name  : SPI_FLASH_WaitForWriteEnd
* Description    : Polls the status of the Write In Progress (WIP) flag in the
*                  FLASH's status  register  and  loop  until write  opertaion
*                  has completed.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_WaitForWriteEnd(void)
{
  u8 FLASH_Status = 0, FLASH_Status1 = 0;

  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "Read Status Register" instruction */
  SPI_FLASH_SendByte(RDSR);

  /*FLASH操作延时计数清0*/
  FlashDelayCount = 0;
  
  /* Loop as long as the memory is busy with a write cycle */
  do
  {
    /* Send a dummy byte to generate the clock needed by the FLASH
    and put the value of the status register in FLASH_Status variable */
    FLASH_Status = SPI_FLASH_SendByte(Dummy_Byte);
    FLASH_Status1 = SPI_FLASH_SendByte(Dummy_Byte);
    
    if(FlashDelayCount > FLASH_DELAY_COUNT_MAX)
    {
	break;//超出规定时间，跳出循环
    }
    
  }
  while ((FLASH_Status & WIP_Flag) == WIP_Flag); /* Write in progress */

	FLASH_Status = FLASH_Status1;
  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();
}

/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/
